Ran Plan for 2 projects:

1. dir: `.` workspace: `default`
1. dir: `tfvars` workspace: `default`

### 1. dir: `.` workspace: `default`
<details><summary>Show Output</summary>

```diff
/home/anson/.atlantis/repos/AnsonYe/GitOps-Atlantis-Using-Test/1/default/default.tfplan


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_s3_bucket.bucket will be created
+ resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "terraform-hello-world-default"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Dev"
          + "Name"        = "My bucket"
        }
      + tags_all                    = {
          + "Environment" = "Dev"
          + "Name"        = "My bucket"
          + "created_by"  = "terraform"
          + "workspace"   = "default"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_s3_bucket.bucket,
│   on main.tf line 22, in resource "aws_s3_bucket" "bucket":
│   22:   acl    = "private"
│ 
│ Use the aws_s3_bucket_acl resource instead
│ 
│ (and one more similar warning elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://186d-122-218-156-179.ngrok-free.app/lock?id=AnsonYe%252FGitOps-Atlantis-Using-Test%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `tfvars` workspace: `default`
**Plan Error**
```
running "/home/anson/.tfenv/bin/terraform plan -input=false -refresh -out \"/home/anson/.atlantis/repos/AnsonYe/GitOps-Atlantis-Using-Test/1/default/tfvars/default.tfplan\" -var-file=tfvars/$WORKSPACE.tfvars" in "/home/anson/.atlantis/repos/AnsonYe/GitOps-Atlantis-Using-Test/1/default/tfvars": exit status 1
/home/anson/.atlantis/repos/AnsonYe/GitOps-Atlantis-Using-Test/1/default/tfvars/default.tfplan

╷
│ Error: Failed to read variables file
│ 
│ Given variables file tfvars/default.tfvars does not exist.
╵

```

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`